/* Button title of notification sheets. */
"TD_BUTTON_CLOSE" = "Close";

/* Button title of error sheets. */
"TD_BUTTON_CLOSE_PROJECT" = "Close Project";

/* Button to create a new project. */
"TD_BUTTON_CREATE" = "Create";

/* Button to create a new offline project. */
"TD_BUTTON_CREATE_OFFLINE" = "Create";

/* Button to join an existing project. */
"TD_BUTTON_JOIN" = "Join";

/* Error message after unexpected connection drop. */
"TD_ERROR_CONNECTION_LOST" = "Connection lost.";

/* Message shown to the user if an internal error occures. */
"TD_ERROR_INTERNAL_ERROR" = "Internal error.";

/* Message shown to the user if the saved and the received repository url don't match. */
"TD_ERROR_MISSMATCHED_REPOSITORY_URL" = "The received repository url does not match the local one.";

/* Error message if a received message is corrupted. */
"TD_ERROR_UNEXPECTED_STATUS_CODE" = "The received data is corrupted.";

/* Error message if the received repository url is invalid. */
"TD_INVALID_REPOSITORY_URL" = "The received repository is invalid.";

/* Error description if the signature is invalid. */
"TD_INVALID_SIGNATURE" = "Invalid git signature.";

/* Message shown to the user while starting the cloning. */
"TD_NOTIFICATION_CLONING_REPOSITORY" = "Cloning repository...";

/* Message shown to the user while connecting to the server. */
"TD_NOTIFICATION_CONNECTING_TO_SERVER" = "Connecting to server...";

/* Shown while fetching from git remote. */
"TD_NOTIFICATION_FETCH_PROGRESS" = "Fetching ...";

/* Shown while pulling from git remote. */
"TD_NOTIFICATION_PULLING_PROGRESS" = "Pulling ...";

/* Shown while pushing to git remote. */
"TD_NOTIFICATION_PUSHING_PROGRESS" = "Pushing ...";

/* Shown while receiving objects from git remote. */
"TD_NOTIFICATION_RECEIVING_OBJECTS" = "Receiving objects...";

/* Notification for the user after a successfull clone. */
"TD_NOTIFICATION_REPOSITORY_CLONED" = "Cloned successfully.";

/* Notification for the user while waiting for a sync start package. */
"TD_NOTIFICATION_REQUESTED_SYNC" = "Requested sync...";

/* Notification for the user after pull started. */
"TD_NOTIFICATION_STARTED_PULLING" = "Fetching...";

/* Notification for the user after a successfull sync. */
"TD_NOTIFICATION_SYNC_COMPLETED" = "Completed sync.";

/* Notification for the user while waiting for the sync to complete. */
"TD_NOTIFICATION_WAITING_FOR_SYNC_TO_COMPLETE" = "Waiting for sync to complete...";

/* Notification for the user while waiting for the own sync to start. */
"TD_NOTIFICATION_WAITING_FOR_SYNC_TO_START" = "Waiting for sync to start...";

